TravelGoodApp/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trav="http://travelgood.ws">
  <soapenv:Body>
    <trav:BookItineraryRequest>
      <trav:CustomerName>Test</trav:CustomerName>
      <trav:ItineraryId>42</trav:ItineraryId>
    </trav:BookItineraryRequest>
  </soapenv:Body>
</soapenv:Envelope>